#pragma once
#include "operand.h"

/*
Класс переменная. Унаследован от класса операнд.
Абстрактное представление переменной (или числовой константы)
*/

class variable :
	public operand
{
public:
	// Конструкторы ----------------------------------------------------------------------------------------
	variable(std::string str, double val = 0) :operand(str), value(val) {}  // Конструктор инициализатор
	variable(const variable& copy) :operand(copy), value(copy.value) {}  // Конструктор копирования

	// Методы ----------------------------------------------------------------------------------------------
	bool getType() { return false; }  // Получение типа потомка
	double getValue() { return value; }  // Получение значения переменной
	void setValue(double val) { value = val; }  // Установка значения переменной

	// Деструктор ------------------------------------------------------------------------------------------
	~variable() {}
private:
	// Поля ------------------------------------------------------------------------------------------------
	double value;  // Значение переменной
};

